1. 936-г 12д хуваагаад гарсан хариуг 9д хуваахад гарах үлдэгдлийг хэвлэнэ үү.
2. Гараас 0-100 хооронд тоон утга авч 90-100-н хооронд байвал true, бусад утгад false буцаа.
3. Он, сараа гараас оруулахад тухайн сар хэд хоногтой болохыг харуул.
4. Өгөгдсөн эерэг тоо нь 3 эсвэл 7-ын үржвэр эсэхийг шалгана уу.
5. Өгөгдсөн тооны тэгш эсвэл сондгой эсэхийг шалгана уу.
6. Өгөгдсөн тооны эерэг тоо эсвэл сөрөг тоо болохыг шалгаад хэвлэж харуулна уу.
7. 4 н хувьсагч зарлан тоон утга өг. Өгөгдсөн 4 тооны 80-аас их тоонуудын нийлбэрийг ол.